tutorials/fluids/shockTube/shockTube_water/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
thermoType     externalStiffenedGasThermo ;//externalStiffenedGasThermo;


stiffenedGasCoeffs
{
    gamma  1.9385878857433527;
    pInf 1158907006.529626;
    Cv 4130.18;
    q  -2289365.0741818445;
    mu 0;
    Pr 7;
};

// ************************************************************************* //
