tutorials/fluids/shockTube/shockTube_water/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho 
    {
      solver          diagonal;
      print           false;
    }

  rhoU 
    {
      solver          diagonal;
      print           false;
    }

  rhoE 
    {
      solver          diagonal;
      print           false;
    }

    p
    {
    }

    U
    {
    }

    T
    {
    }
    
    cellDisplacement
      {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
      }

}

multiStage
{
    numberSubCycles 10000;
    tolerance 1e-4;
    relTol 1e-9;
    infoFrequency      100;
    pseudoStagnationTol 1e-12;
    pseudoStagnationLimit 10;
  }

fieldBounds
{
    // With bounding
    p      1e-6     1e6;
    rho    1e-6     1e6;
    h      1e-6     1e6;
    e      1e-6     1e6;
    rhoE   1e-6     1e6;
    T      1e-6    3000;
    U    1000;
}
// ************************************************************************* //
